 NEWTASK: PROC OPTIONS(MAIN);
     DCL INPFILE1 FILE RECORD INPUT;
     DCL INPFILE2 FILE RECORD INPUT;
     DCL OUTFILE  FILE RECORD OUTPUT;
     DCL STR CHAR(80) INIT('');
     DCL EOF1 BIT(1) INIT('0'B);
     DCL EOF2 BIT(1) INIT('0'B);
     OPEN FILE(OUTFILE);
     DCL 1 REC_INP,
          2 NAME CHAR(10),
          2 SURNAME CHAR(20),
          2 FILL CHAR(994);
      ON ENDFILE(INPFILE1)
         EOF1 = '1'B;
      ON ENDFILE(INPFILE2)
         EOF2 = '1'B;

       OPEN FILE(INPFILE1);
       READ FILE(INPFILE1) INTO (REC_INP);
       DO WHILE(^EOF1);
         STR=REC_INP.NAME||REC_INP.SURNAME;
         READ FILE(INPFILE1) INTO (REC_INP);
         WRITE FILE (OUTFILE) FROM (STR);
       END;
       CLOSE FILE(INPFILE1);

       OPEN FILE(INPFILE2);
       READ FILE(INPFILE2) INTO (REC_INP);
       DO WHILE(^EOF2);
         STR=REC_INP.NAME||REC_INP.SURNAME;
         READ FILE(INPFILE2) INTO (REC_INP);
         WRITE FILE (OUTFILE) FROM (STR);
       END;
       CLOSE FILE(INPFILE2);
     CLOSE FILE(OUTFILE);
 END;
