   /* REXX */
   TRACE 'O'
   PARSE UPPER ARG DB2SYS

   CALL CONNECTDB2
   CALL EXEC_STATEMENT
   CALL DISCONNECTDB2

   CONNECTDB2:
       "SUBCOM DSNREXX"

       IF RC THEN
          S_RC = RXSUBCOM('ADD','DSNREXX','DSNREXX')

       ADDRESS DSNREXX

       "CONNECT" DB2SYS
   RETURN

   EXEC_STATEMENT:
       EXECSTM = "SELECT * FROM LAPUSHA.STUDENT"

       ADDRESS DSNREXX "EXECSQL" ,
                        EXECSTM
   RETURN

   DISCONNECTDB2:
       ADDRESS DSNREXX "DISCONNECT"

       S_RC = RXSUBCOM('DELETE','DSNREXX','DSNREXX')
   RETURN
