 SHOPTSK: PROC OPTIONS(MAIN);
   DCL INPFILE file record input;
   DCL 1 REC_INP,
      2 NAME CHAR(10),
      2 COUNT CHAR(2),
      2 FILL CHAR(68);
   DCL EOF BIT(1) INIT('0'B);
   DCL APPLECOUNT FIXED BIN(31) INIT(0);
   DCL LEMONCOUNT FIXED BIN(31) INIT(0);
   DCL MELONCOUNT FIXED BIN(31) INIT(0);
   DCL TOMATOCOUNT FIXED BIN(31) INIT(0);
   DCL CARROTCOUNT FIXED BIN(31) INIT(0);

   ON ENDFILE(INPFILE)
      EOF = '1'B;

   OPEN FILE(INPFILE);
   READ FILE (INPFILE) INTO (REC_INP);

   DO WHILE(^EOF);

     SELECT(REC_INP.NAME);

       WHEN('APPLE') APPLECOUNT = APPLECOUNT + REC_INP.COUNT;
       WHEN('MELON') MELONCOUNT = MELONCOUNT + REC_INP.COUNT;
       WHEN('TOMATO') TOMATOCOUNT = TOMATOCOUNT + REC_INP.COUNT;
       WHEN('CARROT') CARROTCOUNT = CARROTCOUNT + REC_INP.COUNT;
       WHEN('LEMON') LEMONCOUNT = LEMONCOUNT + REC_INP.COUNT;

     END;

     READ FILE (INPFILE) INTO (REC_INP);

   END;
  /* PUT SKIP LIST('APPLE',' ', APPLECOUNT);*/
  PUT SKIP LIST('APPLE',APPLECOUNT);
  PUT SKIP LIST('MELON',MELONCOUNT);
  PUT SKIP LIST('TOMATO',TOMATOCOUNT);
  PUT SKIP LIST('CARROT',CARROTCOUNT);
  PUT SKIP LIST('LEMON',LEMONCOUNT);
 END;
