 TASK1:PROC OPTIONS(MAIN);
 DCL  IOPCBP     PTR;
 DCL  ALTPCB1    PTR;
 DCL  ALTPCB2    PTR;
 DCL  MSGPCB     PTR;
 DCL  PLITDLI    ENTRY EXT;

 CALL PLITDLI (THREE,GU,IOPCBP,INMSG);
 PUT SKIP EDIT('IMS READ  STATUS: *',IOPCB.STATIO,'*')(A);
 PUT SKIP DATA(INMSG);

 CALL PLITDLI (THREE,ISRT,IOPCBP,OUTMSG);
 PUT SKIP EDIT('IMS WRITE STATUS: *',IOPCB.STATIO,'*')(A);
 END;
