 SHOPTSK: PROC OPTIONS(MAIN);

      EXEC SQL INCLUDE SQLCA;
      DCL I FIXED BIN(31) INIT(0);

      DO I=1 TO 3;

        EXEC SQL
        INSERT INTO SHOP
        (USER_NAME,FRUIT_NAME,FRUIT_QUANTITY,INSERT_FLAG)
        VALUES ('USER19','APPLE',:I,'P');
     END;
 END;
